# 22-09-19 Mon

## 0 setting

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///db_univ7_new.db

## 1 join expression
- (inner) join
- outer join

with condition
- natural: 중복 값 삭제
- on [조건]: (중복 값 삭제 등을 굳이 조건으로 명시해두는 방법)
- using [attribute]: (어떤 attribute를 기준으로 중복 값을 체크할 것인가)

In [10]:
%%sql
select name, course_id 
from  student, takes 
where student.ID = takes.ID;

 * sqlite:///db_univ7_new.db
Done.

[('Zhang', 'CS-101'),
 ('Zhang', 'CS-347'),
 ('Shankar', 'CS-101'),
 ('Shankar', 'CS-190'),
 ('Shankar', 'CS-315'),
 ('Shankar', 'CS-347'),
 ('Brandt', 'HIS-351'),
 ('Chavez', 'FIN-201'),
 ('Levy', 'CS-101'),
 ('Levy', 'CS-101'),
 ('Levy', 'CS-319'),
 ('Williams', 'CS-101'),
 ('Williams', 'CS-190'),
 ('Sanchez', 'MU-199'),
 ('Brown', 'CS-101'),
 ('Brown', 'CS-319'),
 ('Aoi', 'EE-181'),
 ('Bourikas', 'CS-101'),
 ('Bourikas', 'CS-315'),
 ('Tanaka', 'BIO-101'),
 ('Tanaka', 'BIO-301')]

### "natural" join

In [11]:
%%sql select name, course_id 
from student natural join takes;

 * sqlite:///db_univ7_new.db
Done.

[('Zhang', 'CS-101'),
 ('Zhang', 'CS-347'),
 ('Shankar', 'CS-101'),
 ('Shankar', 'CS-190'),
 ('Shankar', 'CS-315'),
 ('Shankar', 'CS-347'),
 ('Brandt', 'HIS-351'),
 ('Chavez', 'FIN-201'),
 ('Levy', 'CS-101'),
 ('Levy', 'CS-101'),
 ('Levy', 'CS-319'),
 ('Williams', 'CS-101'),
 ('Williams', 'CS-190'),
 ('Sanchez', 'MU-199'),
 ('Brown', 'CS-101'),
 ('Brown', 'CS-319'),
 ('Aoi', 'EE-181'),
 ('Bourikas', 'CS-101'),
 ('Bourikas', 'CS-315'),
 ('Tanaka', 'BIO-101'),
 ('Tanaka', 'BIO-301')]

- join하는 table에서 같은 이름을 가지고 있지만, 다른 의미를 가지는 경우 natural join 키워드 사용에 주의
- ex) student - dept_name: 학생의 소속 부서 != course - dept_name: 과목의 개설 부서

In [12]:
%%sql select name, title
from student natural join takes, course
where takes.course_id = course.course_id;

 * sqlite:///db_univ7_new.db
Done.

[('Zhang', 'Intro. to Computer Science'),
 ('Zhang', 'Database System Concepts'),
 ('Shankar', 'Intro. to Computer Science'),
 ('Shankar', 'Game Design'),
 ('Shankar', 'Robotics'),
 ('Shankar', 'Database System Concepts'),
 ('Brandt', 'World History'),
 ('Chavez', 'Investment Banking'),
 ('Levy', 'Intro. to Computer Science'),
 ('Levy', 'Intro. to Computer Science'),
 ('Levy', 'Image Processing'),
 ('Williams', 'Intro. to Computer Science'),
 ('Williams', 'Game Design'),
 ('Sanchez', 'Music Video Production'),
 ('Brown', 'Intro. to Computer Science'),
 ('Brown', 'Image Processing'),
 ('Aoi', 'Intro. to Digital Systems'),
 ('Bourikas', 'Intro. to Computer Science'),
 ('Bourikas', 'Robotics'),
 ('Tanaka', 'Intro. to Biology'),
 ('Tanaka', 'Genetics')]

In [13]:
%%sql select name, title   
from student natural join takes natural join course;

 * sqlite:///db_univ7_new.db
Done.

[('Zhang', 'Intro. to Computer Science'),
 ('Zhang', 'Database System Concepts'),
 ('Shankar', 'Intro. to Computer Science'),
 ('Shankar', 'Game Design'),
 ('Shankar', 'Robotics'),
 ('Shankar', 'Database System Concepts'),
 ('Brandt', 'World History'),
 ('Chavez', 'Investment Banking'),
 ('Williams', 'Intro. to Computer Science'),
 ('Williams', 'Game Design'),
 ('Sanchez', 'Music Video Production'),
 ('Brown', 'Intro. to Computer Science'),
 ('Brown', 'Image Processing'),
 ('Aoi', 'Intro. to Digital Systems'),
 ('Tanaka', 'Intro. to Biology'),
 ('Tanaka', 'Genetics')]

### outer join
- null값을 이용해서, 한 쪽의 table에만 있는 값들의 소실을 방지

In [14]:
%%sql select name, dept_name   
from student;

 * sqlite:///db_univ7_new.db
Done.

[('Zhang', 'Comp. Sci.'),
 ('Shankar', 'Comp. Sci.'),
 ('Brandt', 'History'),
 ('Chavez', 'Finance'),
 ('Peltier', 'Physics'),
 ('Levy', 'Physics'),
 ('Williams', 'Comp. Sci.'),
 ('Sanchez', 'Music'),
 ('Snow', 'Physics'),
 ('Brown', 'Comp. Sci.'),
 ('Aoi', 'Elec. Eng.'),
 ('Bourikas', 'Elec. Eng.'),
 ('Tanaka', 'Biology'),
 ('John', 'History'),
 ('Maria', 'History')]

In [15]:
%%sql select *
from course;

 * sqlite:///db_univ7_new.db
Done.

[('BIO-101', 'Intro. to Biology', 'Biology', 4),
 ('BIO-301', 'Genetics', 'Biology', 4),
 ('BIO-399', 'Computational Biology', 'Biology', 3),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', 4),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4),
 ('CS-315', 'Robotics', 'Comp. Sci.', 3),
 ('CS-319', 'Image Processing', 'Comp. Sci.', 3),
 ('CS-347', 'Database System Concepts', 'Comp. Sci.', 3),
 ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', 3),
 ('FIN-201', 'Investment Banking', 'Finance', 3),
 ('HIS-351', 'World History', 'History', 3),
 ('MU-199', 'Music Video Production', 'Music', 3),
 ('PHY-101', 'Physical Principles', 'Physics', 4)]

- A natural left outer join B
    - A relation에만 있고, B에는 없는 값을 show
    - B의 attribute 값은 null로 채운다.

In [16]:
%%sql select *
from course natural left outer join prereq

 * sqlite:///db_univ7_new.db
Done.

[('BIO-101', 'Intro. to Biology', 'Biology', 4, None),
 ('BIO-301', 'Genetics', 'Biology', 4, 'BIO-101'),
 ('BIO-399', 'Computational Biology', 'Biology', 3, 'BIO-101'),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', 4, None),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4, 'CS-101'),
 ('CS-315', 'Robotics', 'Comp. Sci.', 3, 'CS-101'),
 ('CS-319', 'Image Processing', 'Comp. Sci.', 3, 'CS-101'),
 ('CS-347', 'Database System Concepts', 'Comp. Sci.', 3, 'CS-101'),
 ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', 3, 'PHY-101'),
 ('FIN-201', 'Investment Banking', 'Finance', 3, None),
 ('HIS-351', 'World History', 'History', 3, None),
 ('MU-199', 'Music Video Production', 'Music', 3, None),
 ('PHY-101', 'Physical Principles', 'Physics', 4, None)]

- A natural right outer join B
    - B relation에만 있고, A에는 없는 값을 show
    - A의 attribute 값은 null로 채운다.

In [17]:
%sql select * from course natural right outer join prereq

 * sqlite:///db_univ7_new.db
(sqlite3.OperationalError) RIGHT and FULL OUTER JOINs are not currently supported
[SQL: select * from course natural right outer join prereq]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

- A natural full outer join B
    - A relation에만 있고, B에는 없는 & B relation에만 있고, A에는 없는 값을 모두 show
    - 자신에게 없는 attribute 값은 null로 채운다.

### "on" join

In [18]:
%%sql
select *
from course inner join prereq
on course.course_id = prereq.course_id

 * sqlite:///db_univ7_new.db
Done.

[('BIO-301', 'Genetics', 'Biology', 4, 'BIO-301', 'BIO-101'),
 ('BIO-399', 'Computational Biology', 'Biology', 3, 'BIO-399', 'BIO-101'),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4, 'CS-190', 'CS-101'),
 ('CS-315', 'Robotics', 'Comp. Sci.', 3, 'CS-315', 'CS-101'),
 ('CS-319', 'Image Processing', 'Comp. Sci.', 3, 'CS-319', 'CS-101'),
 ('CS-347', 'Database System Concepts', 'Comp. Sci.', 3, 'CS-347', 'CS-101'),
 ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', 3, 'EE-181', 'PHY-101')]

In [19]:
%%sql
select * from course natural join prereq

 * sqlite:///db_univ7_new.db
Done.

[('BIO-301', 'Genetics', 'Biology', 4, 'BIO-101'),
 ('BIO-399', 'Computational Biology', 'Biology', 3, 'BIO-101'),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4, 'CS-101'),
 ('CS-315', 'Robotics', 'Comp. Sci.', 3, 'CS-101'),
 ('CS-319', 'Image Processing', 'Comp. Sci.', 3, 'CS-101'),
 ('CS-347', 'Database System Concepts', 'Comp. Sci.', 3, 'CS-101'),
 ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', 3, 'PHY-101')]

In [20]:
%%sql
select * from course natural inner join prereq

 * sqlite:///db_univ7_new.db
Done.

[('BIO-301', 'Genetics', 'Biology', 4, 'BIO-101'),
 ('BIO-399', 'Computational Biology', 'Biology', 3, 'BIO-101'),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4, 'CS-101'),
 ('CS-315', 'Robotics', 'Comp. Sci.', 3, 'CS-101'),
 ('CS-319', 'Image Processing', 'Comp. Sci.', 3, 'CS-101'),
 ('CS-347', 'Database System Concepts', 'Comp. Sci.', 3, 'CS-101'),
 ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', 3, 'PHY-101')]

In [21]:
%%sql 
select * 
from course left outer join prereq on course.course_id = prereq.course_id

 * sqlite:///db_univ7_new.db
Done.

[('BIO-101', 'Intro. to Biology', 'Biology', 4, None, None),
 ('BIO-301', 'Genetics', 'Biology', 4, 'BIO-301', 'BIO-101'),
 ('BIO-399', 'Computational Biology', 'Biology', 3, 'BIO-399', 'BIO-101'),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', 4, None, None),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4, 'CS-190', 'CS-101'),
 ('CS-315', 'Robotics', 'Comp. Sci.', 3, 'CS-315', 'CS-101'),
 ('CS-319', 'Image Processing', 'Comp. Sci.', 3, 'CS-319', 'CS-101'),
 ('CS-347', 'Database System Concepts', 'Comp. Sci.', 3, 'CS-347', 'CS-101'),
 ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', 3, 'EE-181', 'PHY-101'),
 ('FIN-201', 'Investment Banking', 'Finance', 3, None, None),
 ('HIS-351', 'World History', 'History', 3, None, None),
 ('MU-199', 'Music Video Production', 'Music', 3, None, None),
 ('PHY-101', 'Physical Principles', 'Physics', 4, None, None)]

### "using" join

In [22]:
%%sql 
select * 
from course left outer join prereq using (course_id)

 * sqlite:///db_univ7_new.db
Done.

[('BIO-101', 'Intro. to Biology', 'Biology', 4, None),
 ('BIO-301', 'Genetics', 'Biology', 4, 'BIO-101'),
 ('BIO-399', 'Computational Biology', 'Biology', 3, 'BIO-101'),
 ('CS-101', 'Intro. to Computer Science', 'Comp. Sci.', 4, None),
 ('CS-190', 'Game Design', 'Comp. Sci.', 4, 'CS-101'),
 ('CS-315', 'Robotics', 'Comp. Sci.', 3, 'CS-101'),
 ('CS-319', 'Image Processing', 'Comp. Sci.', 3, 'CS-101'),
 ('CS-347', 'Database System Concepts', 'Comp. Sci.', 3, 'CS-101'),
 ('EE-181', 'Intro. to Digital Systems', 'Elec. Eng.', 3, 'PHY-101'),
 ('FIN-201', 'Investment Banking', 'Finance', 3, None),
 ('HIS-351', 'World History', 'History', 3, None),
 ('MU-199', 'Music Video Production', 'Music', 3, None),
 ('PHY-101', 'Physical Principles', 'Physics', 4, None)]

## 2 view
: 원하는 relation을 굳이 instance로 저장 x, virtual relation 으로 show
- `create view ~` 로 선언해둔 뒤 그 아래 쿼리에서 사용 가능
- 하나의 view가 다른 view를 선언하는데에 이용될 수 있음

In [23]:
%%sql 
create view faculty as 
select ID, name, dept_name
from instructor

 * sqlite:///db_univ7_new.db
Done.

[]

In [24]:
%sql select name from faculty where dept_name = 'Biology'

 * sqlite:///db_univ7_new.db
Done.

[('Crick',)]

In [25]:
%%sql
create view departments_total_salary(dept_name, total_salary) as
select dept_name, sum (salary)
from instructor
group by dept_name;

 * sqlite:///db_univ7_new.db
Done.

[]

In [26]:
%sql select * from  departments_total_salary

 * sqlite:///db_univ7_new.db
Done.

[('Biology', 72000),
 ('Comp. Sci.', 232000),
 ('Elec. Eng.', 80000),
 ('Finance', 170000),
 ('History', 122000),
 ('Music', 40000),
 ('Physics', 182000)]

In [3]:
%%sql
create view physics_fall_2017 as
select course.course_id, sec_id, building, room_number
from course, section
where course.course_id = section.course_id
and course.dept_name = 'Physics' and section.semester = 'Fall' and section.year = '2017'

UsageError: Cell magic `%%sql` not found.

In [4]:
%sql select * from physics_fall_2017

UsageError: Line magic function `%sql` not found.

In [5]:
%%sql
create view physics_fall_2017_watson as
select course_id, room_number from physics_fall_2017 where building='Watson'

UsageError: Cell magic `%%sql` not found.

In [6]:
%sql select * from physics_fall_2017_watson

UsageError: Line magic function `%sql` not found.

### update view
attribute가 다 차있지 않은 경우,
1. 보통 안되거나
2. 빈 attribute를 `null`값으로 채운 뒤, `original relation`에 insert

In [7]:
%sql insert into faculty values ('30765', 'Green', 'Music');

UsageError: Line magic function `%sql` not found.